{
    "title": "Senior Fullstack Software Engineer, Integrations & IAM",
    "description": "CaptivateIQ is the leading Sales Performance Management solution, recognized by Forrester and G2, and trusted by customers including Affirm, Gong, and Figma. With solutions for Sales Planning and Incentives, we help revenue teams automate processes, hit revenue targets, and adapt to business change, ultimately driving efficient growth for their business. It's time to rethink ROI - your return on incentives - with CaptivateIQ. With backing from Sequoia, Accel, ICONIQ, Sapphire Ventures, and other leading investors, CaptivateIQ is on a mission to enable every company to improve their return on incentives and sales planning. Come and see why Glassdoor and Comparably have recognized CaptivateIQ as a best place to work! About the Role Behind every great software company is the team building it. We are an engineering team of multicultural, highly collaborative, fully distributed, humble learners. We pride ourselves on building best-in-class products powered by innovative technologies. In this role you’d be responsible for helping maintain the foundation that drives our data integrations service, customer-facing Open APIs, as well as our security and compliance features (authentication, authorization, audit logging). CaptivateIQ offers the smartest, most flexible way to automate sales commissions and track sales performance - critical processes that power every successful sales organization on the planet. The Integrations & IAM team builds the core functionality that allows customers to seamlessly bring their own data into the platform and put it to use wherever it lives. The team is also responsible for designing and building frameworks that all other teams at CaptivateIQ use to implement features for large Enterprise customers. We’re currently working on expanded data orchestration and extending our access controls offering to handle some complex and challenging use cases for our customers. If this sounds exciting to you, we’d love to hear from you! Responsibilities: - Design, build, optimize, and maintain CaptivateIQ's data and core platform functionality - Work across our full product stack to develop and improve key product features - Actively participate in the product development process from start to finish, from scoping projects to measuring their success and iterating based on feedback - Maintain high engineering standards, understand and adhere to security best practices, and continuously improve our codebases and processes - Work with engineers across the company to develop and iterate at scale Requirements: - 7+ years experience in a software engineering role - You have strong computer science fundamentals (data structures/algorithms) - You have experience with both frontend and backend development - You exhibit strong verbal and written communication skills - You demonstrate proficiency with Django and React - You have experience with a relational database such as PostgreSQL or MySQL - You have demonstrated a track record of taking responsibility and ownership over core product areas - You have a sharp attention to detail, and a user-centric focus - You have experience making data-driven decisions on product and process - You have experience building a positive remote-first culture Nice to have: - Proficiency with Typescript, AWS, Cypress, Chakra UI Benefits: - Quarterly mental health days so you can recharge - Enjoy a one-time expense on your 1-year work anniversary (to use for travel, home furnishings, fancy meal) - One time work from home stipend & annual stipends for professional development and caretaking - Virtual team lunches to keep you connected - Newest Apple products to help you do your best work - Employee Resource Groups (ERGs) to support and celebrate the shared identities and life experiences of communities within CaptivateIQ. ERGs directly support our company-wide DEI goals as a space for developing and retaining diverse talent. Notice to Prospective Candidates: - Only emails from @captivateiq.com should be trusted. - We are aware of active recruitment scams using the CaptivateIQ name, in which individuals pose as our recruiters and post fake remote job openings and make fake job offers on the Internet. Please note, we will never do the following: - Attempt to correspond with a candidate using a free web-based account, such as an email address that ends in @gmail.com, @yahoo.com, @hotmail.com, etc. - Make an offer of employment without conducting multiple rounds of interviews face-to-face using secure video-conferencing technology. - Ask candidates to cash checks to buy equipment on behalf of CaptivateIQ. - Ask candidates to make a payment in order to be considered for a position. - Make early requests for candidates' personal information such as date of birth, passport details, credit card numbers, bank details and social security number, etc. - Please note that we’ll only ask for more sensitive personal information in connection with background checks after an offer is made.",
    "companyName": "CaptivateIQ",
    "skills": [
        "Django",
        "React",
        "PostgreSQL",
        "MySQL",
        "Typescript",
        "AWS",
        "Cypress",
        "Chakra UI"
    ]
}